{
  "name": "sequential_5",
  "trainable": true,
  "dtype": {
    "module": "keras",
    "class_name": "DTypePolicy",
    "config": {
      "name": "float32"
    },
    "registered_name": null
  },
  "layers": [
    {
      "module": "keras.layers",
      "class_name": "InputLayer",
      "config": {
        "batch_shape": [
          null,
          28,
          28,
          1
        ],
        "dtype": "float32",
        "sparse": false,
        "ragged": false,
        "name": "input_layer_5"
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_10",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 32,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          28,
          28,
          1
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_10",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "gamma_initializer": {
          "module": "keras.initializers",
          "class_name": "Ones",
          "config": {},
          "registered_name": null
        },
        "moving_mean_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "moving_variance_initializer": {
          "module": "keras.initializers",
          "class_name": "Ones",
          "config": {},
          "registered_name": null
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null,
        "synchronized": false
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          28,
          28,
          32
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_10",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_11",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "filters": 64,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "groups": 1,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          14,
          14,
          32
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_11",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "gamma_initializer": {
          "module": "keras.initializers",
          "class_name": "Ones",
          "config": {},
          "registered_name": null
        },
        "moving_mean_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "moving_variance_initializer": {
          "module": "keras.initializers",
          "class_name": "Ones",
          "config": {},
          "registered_name": null
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null,
        "synchronized": false
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          14,
          14,
          64
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_11",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Flatten",
      "config": {
        "name": "flatten_5",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "data_format": "channels_last"
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          7,
          7,
          64
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "dense_10",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 128,
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          3136
        ]
      }
    },
    {
      "module": "keras.layers",
      "class_name": "Dropout",
      "config": {
        "name": "dropout_5",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "rate": 0.4,
        "seed": null,
        "noise_shape": null
      },
      "registered_name": null
    },
    {
      "module": "keras.layers",
      "class_name": "Dense",
      "config": {
        "name": "dense_11",
        "trainable": true,
        "dtype": {
          "module": "keras",
          "class_name": "DTypePolicy",
          "config": {
            "name": "float32"
          },
          "registered_name": null
        },
        "units": 10,
        "activation": "softmax",
        "use_bias": true,
        "kernel_initializer": {
          "module": "keras.initializers",
          "class_name": "GlorotUniform",
          "config": {
            "seed": null
          },
          "registered_name": null
        },
        "bias_initializer": {
          "module": "keras.initializers",
          "class_name": "Zeros",
          "config": {},
          "registered_name": null
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      },
      "registered_name": null,
      "build_config": {
        "input_shape": [
          null,
          128
        ]
      }
    }
  ],
  "build_input_shape": [
    null,
    28,
    28,
    1
  ]
}